English/NewWords/TheDarkKnightRises.org
#+OPTIONS: ^:{} _:{} num:t toc:t \n:t
#+INCLUDE "../../template.org"
#+SETUPFILE: "../../extension.org"
#+title:The Dark Knight Rises
#+html: <center><iframe width="560" height="315" src="http://www.youtube.com/embed/g8evyE9TuYk" frameborder="0" allowfullscreen></iframe></center>
* mercenary
  n 雇佣兵
  adj 唯利是图的 ->adv mercenarily
#+begin_example
They work for the mercenary.
#+end_example
* wreckage
  wreck 失事/残骸
  wreckage
* shipwreck
  船失事
#+begin_example
They expect one of us in the wreckage.
#+end_example
* debris
  废墟/残骸
* mob
  乌合之众/犯罪帮派
#+begin_example
No city is without crime, but this city is without organized crime
because the Dent Act gave law enforcement teeth in its fight against the mob.
#+end_example
* lay eyes on
  看见
#+begin_example
You ever lay eyes on Wayne at one of these things?
#+end_example
* thug
  murderer
* cape
  披肩 
* cowl
  斗蓬
#+begin_example
People put their faith in a murderous thug in a mask and a cape. A thug
who showed his true nature when betrayed the trust of this great man and murdered
him in cold blood.
#+end_example
* inmate
  A person who is confined in a prison, hosptial, etc.
#+begin_example
Maybe right now all you need to know is that there are 1000 inmates in Blackgate Prison
as a direct result of the Dent Act.
#+end_example
* disfigure
  毁坏形象
* staircase
  楼梯
* vanity
  adj vain->n vanity
  徒劳/无价值
#+begin_example
Why are you wasting your time trying to talk to a man who threw away your investment
on some save-the-world vanity project.
#+end_example
* go with your gut
  跟着感觉走
* graphite
  石墨
* basin
  水池 
#+begin_example
We pulled him from the basin.
#+end_example
* sewer
  下水道/地沟
#+begin_example
What kind of work are you gonna find in the sewers?
#+end_example
* babble
  含糊不清地说
#+begin_example
When I pulled him out, he was babbling about an underground army. A masked man called Bane.
#+end_example
* foster
  foster parents 养父母
  foster child 养子/养女
  foster home 寄养家庭
* cartilage
  软骨
* residual
  遗留的
* concussive
  震荡性的
  n concussion
  v concuss 震动/恐吓/使脑震荡
#+begin_example
the residual concussive damage to your brain tissue
#+end_example  
* apathy
  pathetic 同情的
  apathetic 冷漠的
  apathy 冷漠
#+begin_example
You have a practiced apathy, Mr. Wayne.
#+end_example
* crook
  liar
#+begin_example
You wouldn't want these folks realizing you're a crook, not a social climber.
#+end_example
* batten down the hatches
  做好准备
#+begin_example
There is a storm comming, Mr. Wayne. You and Your friends better batten down the hatches, because when
it hits, you're all gonna wonder how you ever thought you could live so large and leave so little for
the rest of us.
#+end_example
* eccentric
  古怪的（a person who has a unusual, peculiar or odd personality）
#+begin_example
-Who are you pretending to be?
-Bruce Wayne, eccentric billionarie.
#+end_example
* burglar
  burglary 盗窃
  burglar 窃贼
* condescend
  谦逊/屈尊
#+begin_example
Don't condescend, Mr. Wayne. You don't know a thing about me.
#+end_example
* subsidiary
  adj 辅助 auxiliary/supplementary
  n 辅助
  subsidiary company 子公司
#+begin_example
After your father died, Wayne Enterprises set up 14 defense subsidiaries.
#+end_example
