English/NewWords/TheDarkKnightRises.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>The Dark Knight Rises</title>
<!-- 2013-06-11 二 10:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="preamble" class="status">
<div id="org-div-comments"><a href="../../index.html#english">主页</a></div>
</div>
<div id="content">
<h1 class="title">The Dark Knight Rises</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. mercenary</a></li>
<li><a href="#sec-2">2. wreckage</a></li>
<li><a href="#sec-3">3. shipwreck</a></li>
<li><a href="#sec-4">4. debris</a></li>
<li><a href="#sec-5">5. mob</a></li>
<li><a href="#sec-6">6. lay eyes on</a></li>
<li><a href="#sec-7">7. thug</a></li>
<li><a href="#sec-8">8. cape</a></li>
<li><a href="#sec-9">9. cowl</a></li>
<li><a href="#sec-10">10. inmate</a></li>
<li><a href="#sec-11">11. disfigure</a></li>
<li><a href="#sec-12">12. staircase</a></li>
<li><a href="#sec-13">13. vanity</a></li>
<li><a href="#sec-14">14. go with your gut</a></li>
<li><a href="#sec-15">15. graphite</a></li>
<li><a href="#sec-16">16. basin</a></li>
<li><a href="#sec-17">17. sewer</a></li>
<li><a href="#sec-18">18. babble</a></li>
<li><a href="#sec-19">19. foster</a></li>
<li><a href="#sec-20">20. cartilage</a></li>
<li><a href="#sec-21">21. residual</a></li>
<li><a href="#sec-22">22. concussive</a></li>
<li><a href="#sec-23">23. apathy</a></li>
<li><a href="#sec-24">24. crook</a></li>
<li><a href="#sec-25">25. batten down the hatches</a></li>
<li><a href="#sec-26">26. eccentric</a></li>
<li><a href="#sec-27">27. burglar</a></li>
<li><a href="#sec-28">28. condescend</a></li>
<li><a href="#sec-29">29. subsidiary</a></li>
<li><a href="#sec-30">30. consolidate</a></li>
<li><a href="#sec-31">31. trifle with</a></li>
<li><a href="#sec-32">32. mattress</a></li>
<li><a href="#sec-33">33. bluff</a></li>
<li><a href="#sec-34">34. ferocity</a></li>
<li><a href="#sec-35">35. hatred</a></li>
<li><a href="#sec-36">36. fraud</a></li>
<li><a href="#sec-37">37. breach</a></li>
<li><a href="#sec-38">38. have a point</a></li>
<li><a href="#sec-39">39. stand on ceremory</a></li>
<li><a href="#sec-40">40. theatricality</a></li>
<li><a href="#sec-41">41. cement</a></li>
<li><a href="#sec-42">42. prime</a></li>
<li><a href="#sec-43">43. blast</a></li>
<li><a href="#sec-44">44. neutron</a></li>
<li><a href="#sec-45">45. detonator</a></li>
<li><a href="#sec-46">46. reconnaissance</a></li>
<li><a href="#sec-47">47. martial</a></li>
<li><a href="#sec-48">48. emissary</a></li>
<li><a href="#sec-49">49. excommunicate</a></li>
<li><a href="#sec-50">50. languish</a></li>
<li><a href="#sec-51">51. resilient</a></li>
<li><a href="#sec-52">52. appall</a></li>
<li><a href="#sec-53">53. decadent</a></li>
<li><a href="#sec-54">54. convene</a></li>
<li><a href="#sec-55">55. plague</a></li>
<li><a href="#sec-56">56. fumbling</a></li>
<li><a href="#sec-57">57. agony</a></li>
<li><a href="#sec-58">58. vertebra</a></li>
<li><a href="#sec-59">59. protrude</a></li>
<li><a href="#sec-60">60. cordon</a></li>
<li><a href="#sec-61">61. vantage</a></li>
<li><a href="#sec-62">62. ignite</a></li>
<li><a href="#sec-63">63. EMP</a></li>
<li><a href="#sec-64">64. wage</a></li>
<li><a href="#sec-65">65. disperse</a></li>
<li><a href="#sec-66">66. venge</a></li>
<li><a href="#sec-67">67. convoy</a></li>
<li><a href="#sec-68">68. abyss</a></li>
<li><a href="#sec-69">69. demolish</a></li>
<li><a href="#sec-70">70. obsolete</a></li>
<li><a href="#sec-71">71. leave no stone unturned</a></li>
<li><a href="#sec-72">72. manifest</a></li>
</ul>
</div>
</div>
<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/too_many_toc.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> mercenary</h2>
<div class="outline-text-2" id="text-1">
<p>
n 雇佣兵<br/>
adj 唯利是图的 -&gt;adv mercenarily<br/>
</p>
<pre class="example">
They work for the mercenary.
</pre>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> wreckage</h2>
<div class="outline-text-2" id="text-2">
<p>
wreck 失事/残骸<br/>
wreckage<br/>
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> shipwreck</h2>
<div class="outline-text-2" id="text-3">
<p>
船失事<br/>
</p>
<pre class="example">
They expect one of us in the wreckage.
</pre>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> debris</h2>
<div class="outline-text-2" id="text-4">
<p>
废墟/残骸<br/>
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> mob</h2>
<div class="outline-text-2" id="text-5">
<p>
乌合之众/犯罪帮派<br/>
</p>
<pre class="example">
No city is without crime, but this city is without organized crime
because the Dent Act gave law enforcement teeth in its fight against the mob.
</pre>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> lay eyes on</h2>
<div class="outline-text-2" id="text-6">
<p>
看见<br/>
</p>
<pre class="example">
You ever lay eyes on Wayne at one of these things?
</pre>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> thug</h2>
<div class="outline-text-2" id="text-7">
<p>
murderer<br/>
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> cape</h2>
<div class="outline-text-2" id="text-8">
<p>
披肩<br/>
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> cowl</h2>
<div class="outline-text-2" id="text-9">
<p>
斗蓬<br/>
</p>
<pre class="example">
People put their faith in a murderous thug in a mask and a cape. A thug
who showed his true nature when betrayed the trust of this great man and murdered
him in cold blood.
</pre>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> inmate</h2>
<div class="outline-text-2" id="text-10">
<p>
A person who is confined in a prison, hosptial, etc.<br/>
</p>
<pre class="example">
Maybe right now all you need to know is that there are 1000 inmates in Blackgate Prison
as a direct result of the Dent Act.
</pre>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> disfigure</h2>
<div class="outline-text-2" id="text-11">
<p>
毁坏形象<br/>
</p>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> staircase</h2>
<div class="outline-text-2" id="text-12">
<p>
楼梯<br/>
</p>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> vanity</h2>
<div class="outline-text-2" id="text-13">
<p>
adj vain-&gt;n vanity<br/>
徒劳/无价值<br/>
</p>
<pre class="example">
Why are you wasting your time trying to talk to a man who threw away your investment
on some save-the-world vanity project.
</pre>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> go with your gut</h2>
<div class="outline-text-2" id="text-14">
<p>
跟着感觉走<br/>
</p>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> graphite</h2>
<div class="outline-text-2" id="text-15">
<p>
石墨<br/>
</p>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> basin</h2>
<div class="outline-text-2" id="text-16">
<p>
水池<br/>
</p>
<pre class="example">
We pulled him from the basin.
</pre>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> sewer</h2>
<div class="outline-text-2" id="text-17">
<p>
下水道/地沟<br/>
</p>
<pre class="example">
What kind of work are you gonna find in the sewers?
</pre>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> babble</h2>
<div class="outline-text-2" id="text-18">
<p>
含糊不清地说<br/>
</p>
<pre class="example">
When I pulled him out, he was babbling about an underground army. A masked man called Bane.
</pre>
</div>
</div>

<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> foster</h2>
<div class="outline-text-2" id="text-19">
<p>
foster parents 养父母<br/>
foster child 养子/养女<br/>
foster home 寄养家庭<br/>
</p>
</div>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> cartilage</h2>
<div class="outline-text-2" id="text-20">
<p>
软骨<br/>
</p>
</div>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> residual</h2>
<div class="outline-text-2" id="text-21">
<p>
遗留的<br/>
</p>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> concussive</h2>
<div class="outline-text-2" id="text-22">
<p>
震荡性的<br/>
n concussion<br/>
v concuss 震动/恐吓/使脑震荡<br/>
</p>
<pre class="example">
the residual concussive damage to your brain tissue
</pre>
</div>
</div>

<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> apathy</h2>
<div class="outline-text-2" id="text-23">
<p>
pathetic 同情的<br/>
apathetic 冷漠的<br/>
apathy 冷漠<br/>
</p>
<pre class="example">
You have a practiced apathy, Mr. Wayne.
</pre>
</div>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> crook</h2>
<div class="outline-text-2" id="text-24">
<p>
liar<br/>
</p>
<pre class="example">
You wouldn't want these folks realizing you're a crook, not a social climber.
</pre>
</div>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> batten down the hatches</h2>
<div class="outline-text-2" id="text-25">
<p>
做好准备<br/>
</p>
<pre class="example">
There is a storm comming, Mr. Wayne. You and Your friends better batten down the hatches, because when
it hits, you're all gonna wonder how you ever thought you could live so large and leave so little for
the rest of us.
</pre>
</div>
</div>

<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> eccentric</h2>
<div class="outline-text-2" id="text-26">
<p>
古怪的（a person who has a unusual, peculiar or odd personality）<br/>
</p>
<pre class="example">
-Who are you pretending to be?
-Bruce Wayne, eccentric billionarie.
</pre>
</div>
</div>

<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> burglar</h2>
<div class="outline-text-2" id="text-27">
<p>
burglary 盗窃<br/>
burglar 窃贼<br/>
</p>
</div>
</div>

<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> condescend</h2>
<div class="outline-text-2" id="text-28">
<p>
谦逊/屈尊<br/>
</p>
<pre class="example">
Don't condescend, Mr. Wayne. You don't know a thing about me.
</pre>
</div>
</div>

<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> subsidiary</h2>
<div class="outline-text-2" id="text-29">
<p>
adj 辅助 auxiliary/supplementary<br/>
n 辅助<br/>
subsidiary company 子公司<br/>
</p>
<pre class="example">
After your father died, Wayne Enterprises set up 14 defense subsidiaries.
</pre>
</div>
</div>
