English/NewWords/TheDarkKnightRises.org
* consolidate
  整合/巩固(bring together separate parts into a single or unified whole)
#+begin_example
For years, I've been shuttering and consolidating all the different prototypes under on roof.
#+end_example
* trifle with
  play with
#+begin_example
I didn't realize I was known for trifling with criminals.
#+end_example
* mattress
  垫子
#+begin_example
Mine's in my mattress.
#+end_example
* bluff
  吓唬
#+begin_example
I'm not bluffing.
#+end_example
* ferocity
  残暴
  adj ferocious 残暴的/非常地 a ferocious thirst.
  adv ferociously
  n   ferociousness
#+begin_example
Look his speed, his ferocity, his training.
#+end_example
* hatred
  v hate
  n hatred
* fraud
  n deception 欺骗
  adj fraudful
  adv fraudfully
#+begin_example
Long-term, we may be able to prove fraud, but for now, you're completely broke and
Wayne Foundation is about to fall into the hands of John Daggett.
#+end_example
* breach
  violation 违反/破坏
#+begin_example
The reactor is beneath the river so it can be instantly flooded in the event of security breach.
#+end_example
* have a point
  make sense
#+begin_example
I'm afraid he has a point, Mr. Wayne.
#+end_example
* stand on ceremory
  (多用在否定语句中)拘谨/遵守礼节
#+begin_example
Let's not stand on ceremory, Mr. Wayne.
#+end_example
* theatricality
#+begin_example
  theatre       戏剧/戏院
  theatrical    戏剧性地/夸张的/做作的
  theatricality 戏剧风格/夸张/不自然
#+end_example
* cement
  水泥
* prime
  adj 首要的
  v 准备好
  primed 准备好的
* blast
  冲击波
* neutron
  中子
#+begin_example
It's a fully primed neutron bomb with a blast radius of six miles.
#+end_example
* detonator
  引爆器
  n detonation 引爆
  v detonate
#+begin_example
For one of you hold the detonator.
#+end_example
* reconnaissance
  侦察/勘测/搜索
  reconnaissance system 侦察系统
  reconnaissance flight 侦察机
  reconnaissance statellite 侦察卫星
* martial
  好战的/战争的/军事的
#+begin_example
For now, martial law is in effect.
#+end_example
* emissary
  ambassador 使者
#+begin_example
Send an emissary to discuss terms of access for supplies and comminucations.
#+end_example
* excommunicate
  驱逐
* languish
  v 失去活力 lose vigor/凋谢
  adj languishing 渐渐衰弱的
  n languishment 衰弱/无力
#+begin_example
Behind you stands a symbol of oppression. Blackgate Prison where a thousand men have languished under the
name of this man, Harvey Dent.
#+end_example
* resilient
  有弹力的/适应性强的/迅速恢复活力的
  n resilience 恢复力/弹力
  adv resiliently 
#+begin_example
The people of our greatest city are resilient, they have proven this before and they will prove this again.
#+end_example
* appall
  astonish/fear/dismay 受到惊吓的
  appalling 震惊的/可怕的
#+begin_example
He saved my boy and took the blame for Harvey's appalling crimes so that I could, to my shame, build
a lie around this fallen idol.
#+end_example
* decadent
  颓废的
  n decadence
#+begin_example
The powerful will be ripped from their decadent nests and cast out into the cold world that we know and endure. 
#+end_example
* convene
  assemble 汇集/召集
#+begin_example
Courts will be convened.
#+end_example
* plague
  n 温瘟
  v 折磨
#+begin_example
Many years ago, it was a time of plague.
#+end_example
* fumbling
  clumsy 笨拙的 show lack of skills or aptitude
* agony
  suffering 痛苦
#+begin_example
The doctor's fumbling attempts to repair the damage left him in perpetual agony.
#+end_example
* vertebra
  脊椎
  vertebrate 有脊椎的
  vertebrates 脊椎动物
  invertebrate 无脊椎的
  Invertebrates 无脊椎的
* protrude
  突出
#+begin_example
There's a vertebra protruding from your back.
#+end_example
* cordon
  n 警戒线
  v 警戒/隔离
#+begin_example
Police have cordoned off the entire Central Heights and East Park Side areas.
#+end_example
* vantage
  有利  advantage
  vantage point 有利点
* ignite
  v ignite 点火
  n ignity 点燃
  n ignitor 点火器
* EMP
  electromagnetic pulse
  电磁脉冲
* wage
  v 发动 carry on a war, conflict, argument, etc.
  n salary
#+begin_example
You're gonna wage a war to save your stuck-up girlfriend.
#+end_example
* disperse
  scatter 分散/散开
#+begin_example
Disperse or be fired upon.
#+end_example
* venge
  venge = avenge = revenge 复仇
  n vengeance
* convoy
  v/n 护送
#+begin_example
Prepare a convoy. We must secure the bomb until it detonates.
#+end_example
* abyss
  无底洞
