English/NewWords/TheDarkKnightRises.html

<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> consolidate</h2>
<div class="outline-text-2" id="text-30">
<p>
整合/巩固(bring together separate parts into a single or unified whole)<br/>
</p>
<pre class="example">
For years, I've been shuttering and consolidating all the different prototypes under on roof.
</pre>
</div>
</div>

<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> trifle with</h2>
<div class="outline-text-2" id="text-31">
<p>
play with<br/>
</p>
<pre class="example">
I didn't realize I was known for trifling with criminals.
</pre>
</div>
</div>

<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> mattress</h2>
<div class="outline-text-2" id="text-32">
<p>
垫子<br/>
</p>
<pre class="example">
Mine's in my mattress.
</pre>
</div>
</div>

<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> bluff</h2>
<div class="outline-text-2" id="text-33">
<p>
吓唬<br/>
</p>
<pre class="example">
I'm not bluffing.
</pre>
</div>
</div>

<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> ferocity</h2>
<div class="outline-text-2" id="text-34">
<p>
残暴<br/>
adj ferocious 残暴的/非常地 a ferocious thirst.<br/>
adv ferociously<br/>
n   ferociousness<br/>
</p>
<pre class="example">
Look his speed, his ferocity, his training.
</pre>
</div>
</div>

<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> hatred</h2>
<div class="outline-text-2" id="text-35">
<p>
v hate<br/>
n hatred<br/>
</p>
</div>
</div>

<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> fraud</h2>
<div class="outline-text-2" id="text-36">
<p>
n deception 欺骗<br/>
adj fraudful<br/>
adv fraudfully<br/>
</p>
<pre class="example">
Long-term, we may be able to prove fraud, but for now, you're completely broke and
Wayne Foundation is about to fall into the hands of John Daggett.
</pre>
</div>
</div>

<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> breach</h2>
<div class="outline-text-2" id="text-37">
<p>
violation 违反/破坏<br/>
</p>
<pre class="example">
The reactor is beneath the river so it can be instantly flooded in the event of security breach.
</pre>
</div>
</div>

<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> have a point</h2>
<div class="outline-text-2" id="text-38">
<p>
make sense<br/>
</p>
<pre class="example">
I'm afraid he has a point, Mr. Wayne.
</pre>
</div>
</div>

<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> stand on ceremory</h2>
<div class="outline-text-2" id="text-39">
<p>
(多用在否定语句中)拘谨/遵守礼节<br/>
</p>
<pre class="example">
Let's not stand on ceremory, Mr. Wayne.
</pre>
</div>
</div>

<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> theatricality</h2>
<div class="outline-text-2" id="text-40">
<pre class="example">
theatre       戏剧/戏院
theatrical    戏剧性地/夸张的/做作的
theatricality 戏剧风格/夸张/不自然
</pre>
</div>
</div>

<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> cement</h2>
<div class="outline-text-2" id="text-41">
<p>
水泥<br/>
</p>
</div>
</div>

<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> prime</h2>
<div class="outline-text-2" id="text-42">
<p>
adj 首要的<br/>
v 准备好<br/>
primed 准备好的<br/>
</p>
</div>
</div>

<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> blast</h2>
<div class="outline-text-2" id="text-43">
<p>
冲击波<br/>
</p>
</div>
</div>

<div id="outline-container-sec-44" class="outline-2">
<h2 id="sec-44"><span class="section-number-2">44</span> neutron</h2>
<div class="outline-text-2" id="text-44">
<p>
中子<br/>
</p>
<pre class="example">
It's a fully primed neutron bomb with a blast radius of six miles.
</pre>
</div>
</div>

<div id="outline-container-sec-45" class="outline-2">
<h2 id="sec-45"><span class="section-number-2">45</span> detonator</h2>
<div class="outline-text-2" id="text-45">
<p>
引爆器<br/>
n detonation 引爆<br/>
v detonate<br/>
</p>
<pre class="example">
For one of you hold the detonator.
</pre>
</div>
</div>

<div id="outline-container-sec-46" class="outline-2">
<h2 id="sec-46"><span class="section-number-2">46</span> reconnaissance</h2>
<div class="outline-text-2" id="text-46">
<p>
侦察/勘测/搜索<br/>
reconnaissance system 侦察系统<br/>
reconnaissance flight 侦察机<br/>
reconnaissance statellite 侦察卫星<br/>
</p>
</div>
</div>

<div id="outline-container-sec-47" class="outline-2">
<h2 id="sec-47"><span class="section-number-2">47</span> martial</h2>
<div class="outline-text-2" id="text-47">
<p>
好战的/战争的/军事的<br/>
</p>
<pre class="example">
For now, martial law is in effect.
</pre>
</div>
</div>

<div id="outline-container-sec-48" class="outline-2">
<h2 id="sec-48"><span class="section-number-2">48</span> emissary</h2>
<div class="outline-text-2" id="text-48">
<p>
ambassador 使者<br/>
</p>
<pre class="example">
Send an emissary to discuss terms of access for supplies and comminucations.
</pre>
</div>
</div>

<div id="outline-container-sec-49" class="outline-2">
<h2 id="sec-49"><span class="section-number-2">49</span> excommunicate</h2>
<div class="outline-text-2" id="text-49">
<p>
驱逐<br/>
</p>
</div>
</div>

<div id="outline-container-sec-50" class="outline-2">
<h2 id="sec-50"><span class="section-number-2">50</span> languish</h2>
<div class="outline-text-2" id="text-50">
<p>
v 失去活力 lose vigor/凋谢<br/>
adj languishing 渐渐衰弱的<br/>
n languishment 衰弱/无力<br/>
</p>
<pre class="example">
Behind you stands a symbol of oppression. Blackgate Prison where a thousand men have languished under the
name of this man, Harvey Dent.
</pre>
</div>
</div>

<div id="outline-container-sec-51" class="outline-2">
<h2 id="sec-51"><span class="section-number-2">51</span> resilient</h2>
<div class="outline-text-2" id="text-51">
<p>
有弹力的/适应性强的/迅速恢复活力的<br/>
n resilience 恢复力/弹力<br/>
adv resiliently<br/>
</p>
<pre class="example">
The people of our greatest city are resilient, they have proven this before and they will prove this again.
</pre>
</div>
</div>

<div id="outline-container-sec-52" class="outline-2">
<h2 id="sec-52"><span class="section-number-2">52</span> appall</h2>
<div class="outline-text-2" id="text-52">
<p>
astonish/fear/dismay 受到惊吓的<br/>
appalling 震惊的/可怕的<br/>
</p>
<pre class="example">
He saved my boy and took the blame for Harvey's appalling crimes so that I could, to my shame, build
a lie around this fallen idol.
</pre>
</div>
</div>

<div id="outline-container-sec-53" class="outline-2">
<h2 id="sec-53"><span class="section-number-2">53</span> decadent</h2>
<div class="outline-text-2" id="text-53">
<p>
颓废的<br/>
n decadence<br/>
</p>
<pre class="example">
The powerful will be ripped from their decadent nests and cast out into the cold world that we know and endure.
</pre>
</div>
</div>

<div id="outline-container-sec-54" class="outline-2">
<h2 id="sec-54"><span class="section-number-2">54</span> convene</h2>
<div class="outline-text-2" id="text-54">
<p>
assemble 汇集/召集<br/>
</p>
<pre class="example">
Courts will be convened.
</pre>
</div>
</div>

<div id="outline-container-sec-55" class="outline-2">
<h2 id="sec-55"><span class="section-number-2">55</span> plague</h2>
<div class="outline-text-2" id="text-55">
<p>
n 温瘟<br/>
v 折磨<br/>
</p>
<pre class="example">
Many years ago, it was a time of plague.
</pre>
</div>
</div>

<div id="outline-container-sec-56" class="outline-2">
<h2 id="sec-56"><span class="section-number-2">56</span> fumbling</h2>
<div class="outline-text-2" id="text-56">
<p>
clumsy 笨拙的 show lack of skills or aptitude<br/>
</p>
</div>
</div>

<div id="outline-container-sec-57" class="outline-2">
<h2 id="sec-57"><span class="section-number-2">57</span> agony</h2>
<div class="outline-text-2" id="text-57">
<p>
suffering 痛苦<br/>
</p>
<pre class="example">
The doctor's fumbling attempts to repair the damage left him in perpetual agony.
</pre>
</div>
</div>

<div id="outline-container-sec-58" class="outline-2">
<h2 id="sec-58"><span class="section-number-2">58</span> vertebra</h2>
<div class="outline-text-2" id="text-58">
<p>
脊椎<br/>
vertebrate 有脊椎的<br/>
vertebrates 脊椎动物<br/>
invertebrate 无脊椎的<br/>
Invertebrates 无脊椎的<br/>
</p>
</div>
</div>

<div id="outline-container-sec-59" class="outline-2">
<h2 id="sec-59"><span class="section-number-2">59</span> protrude</h2>
<div class="outline-text-2" id="text-59">
<p>
突出<br/>
</p>
<pre class="example">
There's a vertebra protruding from your back.
</pre>
</div>
</div>

<div id="outline-container-sec-60" class="outline-2">
<h2 id="sec-60"><span class="section-number-2">60</span> cordon</h2>
<div class="outline-text-2" id="text-60">
<p>
n 警戒线<br/>
v 警戒/隔离<br/>
</p>
<pre class="example">
Police have cordoned off the entire Central Heights and East Park Side areas.
</pre>
</div>
</div>

<div id="outline-container-sec-61" class="outline-2">
<h2 id="sec-61"><span class="section-number-2">61</span> vantage</h2>
<div class="outline-text-2" id="text-61">
<p>
有利  advantage<br/>
vantage point 有利点<br/>
</p>
</div>
</div>

<div id="outline-container-sec-62" class="outline-2">
<h2 id="sec-62"><span class="section-number-2">62</span> ignite</h2>
<div class="outline-text-2" id="text-62">
<p>
v ignite 点火<br/>
n ignity 点燃<br/>
n ignitor 点火器<br/>
</p>
</div>
</div>

<div id="outline-container-sec-63" class="outline-2">
<h2 id="sec-63"><span class="section-number-2">63</span> EMP</h2>
<div class="outline-text-2" id="text-63">
<p>
electromagnetic pulse<br/>
电磁脉冲<br/>
</p>
</div>
</div>

<div id="outline-container-sec-64" class="outline-2">
<h2 id="sec-64"><span class="section-number-2">64</span> wage</h2>
<div class="outline-text-2" id="text-64">
<p>
v 发动 carry on a war, conflict, argument, etc.<br/>
n salary<br/>
</p>
<pre class="example">
You're gonna wage a war to save your stuck-up girlfriend.
</pre>
</div>
</div>

<div id="outline-container-sec-65" class="outline-2">
<h2 id="sec-65"><span class="section-number-2">65</span> disperse</h2>
<div class="outline-text-2" id="text-65">
<p>
scatter 分散/散开<br/>
</p>
<pre class="example">
Disperse or be fired upon.
</pre>
</div>
</div>

<div id="outline-container-sec-66" class="outline-2">
<h2 id="sec-66"><span class="section-number-2">66</span> venge</h2>
<div class="outline-text-2" id="text-66">
<p>
venge = avenge = revenge 复仇<br/>
n vengeance<br/>
</p>
</div>
</div>

<div id="outline-container-sec-67" class="outline-2">
<h2 id="sec-67"><span class="section-number-2">67</span> convoy</h2>
<div class="outline-text-2" id="text-67">
<p>
v/n 护送<br/>
</p>
<pre class="example">
Prepare a convoy. We must secure the bomb until it detonates.
</pre>
</div>
</div>
