English/NewWords/TheDarkKnightRises.org
* demolish
  destroy
#+begin_example
The house and grounds are left to the city of Gotham on condition that they never be demolished,
altered or otherwise interfered with and that they shall be used for one purpose and one purpose only:
The housing and care of the city's at-risk and orphaned children.
#+end_example
* obsolete
  过时的/没用的
#+begin_example
This entirely autopilot system's completely obsolete.
#+end_example
* leave no stone unturned
  翻遍每块石头 指 用力全力地/不遗余力地/千方百计地
* manifest
  货物单
#+begin_example
They better leave no stone unturned, we can't leave a string of pearls on the manifest as lost.
#+end_example
