English/NewWords/TheDarkKnightRises.html

<div id="outline-container-sec-68" class="outline-2">
<h2 id="sec-68"><span class="section-number-2">68</span> abyss</h2>
<div class="outline-text-2" id="text-68">
<p>
无底洞<br/>
</p>
</div>
</div>

<div id="outline-container-sec-69" class="outline-2">
<h2 id="sec-69"><span class="section-number-2">69</span> demolish</h2>
<div class="outline-text-2" id="text-69">
<p>
destroy<br/>
</p>
<pre class="example">
The house and grounds are left to the city of Gotham on condition that they never be demolished,
altered or otherwise interfered with and that they shall be used for one purpose and one purpose only:
The housing and care of the city's at-risk and orphaned children.
</pre>
</div>
</div>

<div id="outline-container-sec-70" class="outline-2">
<h2 id="sec-70"><span class="section-number-2">70</span> obsolete</h2>
<div class="outline-text-2" id="text-70">
<p>
过时的/没用的<br/>
</p>
<pre class="example">
This entirely autopilot system's completely obsolete.
</pre>
</div>
</div>

<div id="outline-container-sec-71" class="outline-2">
<h2 id="sec-71"><span class="section-number-2">71</span> leave no stone unturned</h2>
<div class="outline-text-2" id="text-71">
<p>
翻遍每块石头 指 用力全力地/不遗余力地/千方百计地<br/>
</p>
</div>
</div>

<div id="outline-container-sec-72" class="outline-2">
<h2 id="sec-72"><span class="section-number-2">72</span> manifest</h2>
<div class="outline-text-2" id="text-72">
<p>
货物单<br/>
</p>
<pre class="example">
They better leave no stone unturned, we can't leave a string of pearls on the manifest as lost.
</pre>
</div>
</div>
</div>
</body>
</html>
